


Network Working Group                                        J. Korhonen
Internet-Draft                                                U. Nilsson
Intended status: Standards Track                             TeliaSonera
Expires: May 6, 2009                                    November 2, 2008


                   Service Selection for Mobile IPv4
                   draft-korhonen-mip4-service-05.txt

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on May 6, 2009.

Copyright Notice

   Copyright (C) The IETF Trust (2008).

Abstract

   In some Mobile IPv4 deployments identifying the mobile node or the
   mobility service subscriber is not enough to distinguish between
   multiple services possibly provisioned to the said mobile node and
   its mobility service subscription.  A capability to specify different
   services in addition to the mobile node identity can be leveraged to
   provide flexibility for mobility service providers to provide
   multiple services within a single mobility service subscription.
   This document describes a Service Selection Extension for Mobile IPv4



Korhonen & Nilsson         Expires May 6, 2009                  [Page 1]

Internet-Draft         Service Selection for MIPv4         November 2008


   that is intended to assist home agents to make specific service
   selections for the mobility service subscription during the
   registration procedure.


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3
   2.  Requirements . . . . . . . . . . . . . . . . . . . . . . . . .  4
   3.  Service Selection Extension  . . . . . . . . . . . . . . . . .  4
   4.  Processing Considerations  . . . . . . . . . . . . . . . . . .  6
     4.1.  Mobile Node Considerations . . . . . . . . . . . . . . . .  6
     4.2.  Home Agent Considerations  . . . . . . . . . . . . . . . .  6
     4.3.  Foreign Agent Considerations . . . . . . . . . . . . . . .  7
   5.  Security Considerations  . . . . . . . . . . . . . . . . . . .  7
   6.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . .  8
   7.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . .  8
   8.  References . . . . . . . . . . . . . . . . . . . . . . . . . .  8
     8.1.  Normative References . . . . . . . . . . . . . . . . . . .  8
     8.2.  Informative References . . . . . . . . . . . . . . . . . .  9
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . .  9
   Intellectual Property and Copyright Statements . . . . . . . . . . 10





























Korhonen & Nilsson         Expires May 6, 2009                  [Page 2]

Internet-Draft         Service Selection for MIPv4         November 2008


1.  Introduction

   Mobile IPv4 [1] can identify mobile nodes in various ways, including
   home addresses [1] and Network Access Identifiers (NAI) [5][6].  In
   some Mobile IPv4 deployments identifying the mobile node or the
   mobility service subscriber via a Proxy Mobile IPv4 client [7]
   (hereafter the mobile node and the Proxy Mobile IPv4 client are used
   interchangeably) is not enough to distinguish between multiple
   services possibly provisioned to the said mobile node and its
   mobility service subscription.

   The capability to specify different services in addition to the
   mobile node identity can be leveraged to provide flexibility for
   mobility service providers to provide multiple services within the
   same mobility service subscription.  For example:

   o  Provide an enterprise data access for which the mobility service
      provider hosts connectivity and mobility services on behalf of the
      enterprise.

   o  Provide access to service domains that are otherwise not
      accessible from public networks because of some mobility service
      provider's business reasons.

   o  Provide simultaneous access to different service domains that are
      separated based on policies of the mobility service provider.

   o  Enable easier policy assignment for mobility service providers
      based on the subscribed services.

   o  In absence of a specifically indicated service the home agent MUST
      act as if the default service, plain Internet access had been
      requested.  There is no absolute requirement that this default
      service be allowed to all subscribers, but it is highly
      RECOMMENDED in order to avoid having normal subscribers employ
      operator-specific configuration values in order to get basic
      service.

   This document describes a Service Selection Extension for Mobile IPv4
   that is intended to assist home agents to make specific service
   selections for the mobility service subscription during the
   registration procedure.  The service selection may affect home agent
   routing decisions, Home Address assignment policies, firewall
   settings, and security policies.  The Service Selection extension
   SHOULD be used in every Registration Request that makes a new
   registration to the home agent.  The Service Selection extension from
   the Registration Request MAY be echoed back in the Registration
   Reply.



Korhonen & Nilsson         Expires May 6, 2009                  [Page 3]

Internet-Draft         Service Selection for MIPv4         November 2008


   Some of the potential use-cases were listed earlier in this section.
   The general aim is better manageability of services and service
   provisioning from both operators and service providers point of view.
   However, it should be understood that there are potential deployment
   possibilities where selecting a certain service may restricts
   simultaneous access to other services from an user point of view.
   For example, services may be located in different administrative
   domains or external customer networks that practice excessive
   filtering of inbound and outbound traffic.


2.  Requirements

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [2].


3.  Service Selection Extension

   At most one Service Selection extension MAY be included in any Mobile
   IPv4 Registration Request message.  It SHOULD be included at least in
   the Registration Request message that is sent for the initial binding
   registration when the mobile node and the home agent do not have an
   existing binding.  The Service Selection extension MUST be placed in
   the Registration Request message as follows:

   o  When present the extension MUST appear after the MN-NAI extension,
      if the MN-NAI is also present in the message

   o  If the extension was added by the mobile node to a Registration
      Request it MUST appear prior any authentication-enabling
      extensions [1][8]

   o  In the event the foreign agent adds the Service Selection
      extension to a Registration Request, the extension MUST appear
      prior to any Foreign-Home authentication-enabling extensions [1]

   The Home Agent MAY echo the received Service Selection extension
   option back in a Mobile IPv4 Registration Reply message.  The echoed
   Service Selection extension MUST be an unchanged copy of the Service
   Selection extension received in the corresponding Registration
   Request message.  The Service Selection extension MUST be placed in
   the Registration Reply message as follows:

   o  If the extension was originally added by the mobile node to a
      Registration Request it MUST appear in the Registration Reply
      prior any authentication-enabling extensions [1][8]



Korhonen & Nilsson         Expires May 6, 2009                  [Page 4]

Internet-Draft         Service Selection for MIPv4         November 2008


   o  If the foreign agent added the Service Selection extension to a
      Registration Request, the extension MUST appear in the
      Registration Reply prior to any Foreign-Home authentication-
      enabling extensions [1]

   The Service Selection extension has the following format:


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Type = TBD   |   Length      | Index
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                                   | Identifier...                 ~
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                        Service Selection Extension

   o  Type: 8-bit identifier set to TBD (to be defined by IANA) of the
      type of this skippable extension.

   o  Length: 8-bit unsigned integer, representing the length of the
      Service Selection Extension in octets, excluding the Type and
      Length fields.  A value of zero (0) is not allowed.

   o  Index: A 32-bit unsigned integer in a networking order
      representing the service Index.  The service Index is used to
      distinguish between Identifier strings with the same content.  It
      can also be used to distinguish between retransmissions and
      creations of new mobility sessions.  The service Index value is
      allocated by the node who includes the Service Selection
      extension.  The values MUST be unique between the node who
      allocated them and the corresponding home agent.  The service
      Index MUST remain unchanged during the life time of the mobility
      session.

      The value of zero (0) is reserved and means that the receiver MUST
      ignore the service Index functionality.

   o  Identifier: A variable-length encoded service identifier string
      used to identify the requested service.  The identifier string
      length is between 1 and 255 octets.  This specification allows
      international identifier strings that are based on the use of
      Unicode characters, encoded as UTF-8 [3], and formatted using
      Normalization Form KC (NFKC) as specified in [4].

      'ims', 'voip' and 'voip.companyxyz.example.com' are valid examples
      of Service Selection extension Identifiers.  At minimum the



Korhonen & Nilsson         Expires May 6, 2009                  [Page 5]

Internet-Draft         Service Selection for MIPv4         November 2008


      Identifier MUST be unique among the home agents the mobile node is
      authorized to register to.


4.  Processing Considerations

4.1.  Mobile Node Considerations

   A mobile node or its proxy representative MAY include the Service
   Selection extension into any Registration Request message.  The
   Service Selection extension can be used with any mobile node
   identification method.  The extension is used to identify the service
   to be associated with the mobility session and SHOULD only be
   included into the initial Registration Request message sent to a home
   agent.  If the mobile node wishes to change the selected service, it
   is RECOMMENDED that the mobile node de-register the existing binding
   with the home agent before proceeding with a binding registration for
   a different service.  The provisioning of the service identifiers to
   the mobile node or its proxy representative is out of scope of this
   specification.

   If the mobile node receives a Registration Reply message with a Code
   set to SERVICE_AUTHORIZATION_FAILED and the mobile node has an
   existing binding with the Home Address used in the failed
   Registration Request message, the mobile node MUST delete the
   existing binding.  If there is no existing binding the mobile node
   proceeds as with any failed initial registration.

4.2.  Home Agent Considerations

   Upon receiving the Service Selection extension the home agent
   authenticates and authorizes the mobile node.  If the home agent
   supports the Service Selection it MUST also verify that the mobile
   node is authorized to the service identified by the Service Selection
   extension.  The services the mobile node is authorized to SHOULD be
   part of the general mobile node subscription data.  If the mobile
   node is not authorized to the service the home agent MUST deny the
   registration and send a Registration Reply with a Code
   SERVICE_AUTHORIZATION_FAILED (error code TBD).

   The Service Selection extension is used to assist the mobile node
   authorization phase and identifies a specific service that is to be
   authorized.  The Service Selection extension MAY also affect the Home
   Address allocation when for example used with the MN-NAI extension.
   For example, for the same NAI there MAY be different Home Addresses
   depending on the identified service.  Furthermore, the Service
   Selection extension MAY also affect the routing of the outbound IP
   packets in the home agent depending on the selected service.  The



Korhonen & Nilsson         Expires May 6, 2009                  [Page 6]

Internet-Draft         Service Selection for MIPv4         November 2008


   home agent MAY also apply different policy or quality of service
   treatment to traffic flows based on the selected service.

   If the newly arrived Registration Request message with a Service
   Selection extension indicates a change in the selected service, then
   the home agent MUST re-authorize the mobile node.  Depending on the
   home agent policies, the services policies, Home Address allocation
   policies and the subscription policies the home agent may or may not
   be able to authorize the mobile node to the new service.  For example
   the existing service and the new service could require different Home
   Addresses.  If the authorization fails then the home agent MUST deny
   the registration, delete any binding with the existing Home Address
   and send a Registration Reply with a Code set to
   SERVICE_AUTHORIZATION_FAILED (error code TBD).

   Depending on the local home agent policy, the home agent MAY echo
   back the Service Selection extension in the corresponding
   Registration Reply message towards the mobile node or the foreign
   agent.  The home agent MUST NOT change the content of the echoed
   Service Selection extension.

4.3.  Foreign Agent Considerations

   A foreign agent MUST skip the Service Selection extension if the
   Registration Request already contains the Service Selection
   extension.  If the Registration Request does not contain the Service
   Selection extension the foreign agent MAY add the Service Selection
   extension to the Registration Request message.  How the foreign agent
   learns the service the mobile nodes needs to authorize to is outside
   of scope of this document.

   In the case a foreign agent added the Service Selection extension to
   the Registration Request on behalf of the mobile node, it MUST verify
   whether the corresponding Registration Reply message from a home
   agent also contains an echoed Service Selection extension.  If the
   received Registration Reply message contains the echoed Service
   Selection extension, the foreign agent MUST NOT include the extension
   to the Registration Reply message that gets forwarded to the mobile
   node.


5.  Security Considerations

   The protection for the Service Selection extension depends on the
   service that is being identified and eventually selected.  If the
   service selection information should not be revealed on the wire it
   should be protected in a manner similar to Registration Requests and
   Registration Replies.  The Service Selection extension is protected



Korhonen & Nilsson         Expires May 6, 2009                  [Page 7]

Internet-Draft         Service Selection for MIPv4         November 2008


   by the same authentication enabling extension as the rest of the
   Registration Request message.

   The home agent MUST verify that the mobile node is authorized to the
   service included in the Service Selection extension.  The Service
   Selection extension authorization is part of the normal mobile node
   registration and authentication procedure.  Both registration
   authentication and service authorization MUST succeed before the
   mobile node is allowed to register to the home agent.


6.  IANA Considerations

   A new Mobile IPv4 skippable Extension type is required for the
   following new Extension described in Section 3.  The Extension type
   must be from the 'skippable Extension' range (128-255):

       Service Selection Extension       is set to TBD

   A new Mobile IPv4 registration denied by home agent error code is
   required.  The error code must be allocated from the 'Error Codes
   from the Home Agent' range (128-192):

       SERVICE_AUTHORIZATION_FAILED      is set to TBD


7.  Acknowledgements

   The authors would like to thank Henrik Levkowetz and Kent Leung for
   their comments.


8.  References

8.1.  Normative References

   [1]  Perkins, C., "IP Mobility Support for IPv4", RFC 3344,
        August 2002.

   [2]  Bradner, S., "Key words for use in RFCs to Indicate Requirement
        Levels", BCP 14, RFC 2119, March 1997.

   [3]  Yergeau, F., "UTF-8, a transformation format of ISO 10646",
        STD 63, RFC 3629, November 2003.

   [4]  Davis, M. and M. Durst, "Unicode Standard Annex #15; Unicode
        Normalization Forms", Unicode 5.0.0, October 2006.




Korhonen & Nilsson         Expires May 6, 2009                  [Page 8]

Internet-Draft         Service Selection for MIPv4         November 2008


8.2.  Informative References

   [5]  Aboba, B., Beadles, M., Arkko, J., and P. Eronen, "The Network
        Access Identifier", RFC 4282, December 2005.

   [6]  Calhoun, P. and C. Perkins, "Mobile IP Network Access Identifier
        Extension for IPv4", RFC 2794, March 2000.

   [7]  Leung, K., "WiMAX Forum/3GPP2 Proxy Mobile IPv4",
        draft-leung-mip4-proxy-mode-09 (work in progress), August 2008.

   [8]  Perkins, C., Calhoun, P., and J. Bharatia, "Mobile IPv4
        Challenge/Response Extensions (Revised)", RFC 4721,
        January 2007.


Authors' Addresses

   Jouni Korhonen
   TeliaSonera Corporation.
   P.O.Box 970
   FIN-00051 Sonera
   FINLAND

   Email: jouni.nospam@gmail.com


   Ulf Nilsson
   TeliaSonera Corporation.
   Marbackagatan 11
   S-123 86 Farsta
   SWEDEN

   Email: ulf.s.nilsson@teliasonera.com

















Korhonen & Nilsson         Expires May 6, 2009                  [Page 9]

Internet-Draft         Service Selection for MIPv4         November 2008


Full Copyright Statement

   Copyright (C) The IETF Trust (2008).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Intellectual Property

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Acknowledgment

   Funding for the RFC Editor function is provided by the IETF
   Administrative Support Activity (IASA).





Korhonen & Nilsson         Expires May 6, 2009                 [Page 10]

